s = input("Введите строку ")
if s[len(s) - 1] != ".":
    s = input("Введите строку ")
print(len(s))
p = 0
l = 0
for i in s:
    if i == " ":
        p = p + 1
    l = p + 1
count = 0
for i in s:
    if i == " ":
        p = p + 1
    #и тут сравниваем длину count с количеством max и min и присваиваем ему это значение
    #будет вложенный if когда count снова будет равен 0 И снова начинаем работу цикла
    # for для счета длины второго слова
print(l)
w = #задать слово и начать считать длину слов и выдавать результат самой большой длины и самой мелкой
len(w)
